In [82]:
import numpy as np
import pandas as pd

In [ ]:
my_array = np.zeros(10, dtype=int)
my_array[4] = 1

In [84]:
arr_matrix = np.arange(16).reshape(4, 4)

In [85]:
arr1 = np.array([[41, 30, 10], 
                [ 6, 35, 23], 
                [23,  9, 10]])

arr2 = np.array([[4, 29,  2], 
                 [5, 13,  3], 
                 [24, 16,  7]])

addition = np.add(arr1, arr2)
subtraction = np.subtract(arr1, arr2)
multiplication = np.multiply(arr1, arr2)
division = np.divide(arr1, arr2)

In [86]:
arr = np.arange(1, 11) * 10
arr[2:7]

array([30, 40, 50, 60, 70])

In [87]:

array_3x3 = np.array([[15, 18, 20], 
                      [15, 30, 8], 
                      [25, 30, 60]])

array_3x3.mean().round(2)
array_3x3.sum()
array_3x3.max()

60

In [88]:
series = pd.Series([10, 20, 30, 40, 50], index = ['a', 'b', 'c', 'd', 'e'])

In [89]:
df = pd.read_csv("data//data.csv")
df

       Name  Age  Salary
0     Alice   29   73193
1       Bob   53   85398
2   Charlie   36   47162
3     David   22   65853
4       Eve   24   36168
5     Frank   58   69657
6     Grace   41   85202
7    Hannah   38   62421
8     Isaac   50   74641
9      Jack   47   38963
10    Karen   34   32136
11      Leo   49   41874
12     Mona   56   34070
13     Nina   49   91734
14    Oscar   30   89539
15     Paul   23   78720
16    Quinn   31   54424
17   Rachel   54   59900
18    Steve   36   32163
19     Tina   56   52054

In [90]:
df.head(3)

      Name  Age  Salary
0    Alice   29   73193
1      Bob   53   85398
2  Charlie   36   47162

In [91]:
df["Tax"] = df["Salary"] * 10/100

print(df.head())

      Name  Age  Salary     Tax
0    Alice   29   73193  7319.3
1      Bob   53   85398  8539.8
2  Charlie   36   47162  4716.2
3    David   22   65853  6585.3
4      Eve   24   36168  3616.8

In [92]:
df[df['Age'] > 36]

      Name  Age  Salary     Tax
1      Bob   53   85398  8539.8
5    Frank   58   69657  6965.7
6    Grace   41   85202  8520.2
7   Hannah   38   62421  6242.1
8    Isaac   50   74641  7464.1
9     Jack   47   38963  3896.3
11     Leo   49   41874  4187.4
12    Mona   56   34070  3407.0
13    Nina   49   91734  9173.4
17  Rachel   54   59900  5990.0
19    Tina   56   52054  5205.4

In [93]:
# Sample Data
sales_data = pd.DataFrame({
    "Region": ["North", "South", "North", "West", "South", "West"],
    "Sales": [1000, 1500, 1200, 1800, 1300, 1700]
})
sales_data.head()

  Region  Sales
0  North   1000
1  South   1500
2  North   1200
3   West   1800
4  South   1300

In [94]:
sales_summary = sales_data.groupby('Region')['Sales'].agg(['sum', 'mean'])
sales_summary.reset_index(inplace=True)
sales_summary.columns = ['Region', 'Total Sales', 'Mean']

sales_summary

  Region  Total Sales    Mean
0  North         2200  1100.0
1  South         2800  1400.0
2   West         3500  1750.0

In [95]:
customers = pd.DataFrame({
    "CustomerID": [1, 2, 3, 4],
    "CustomerName": ["Alice", "Bob", "Charlie", "David"]
})

orders = pd.DataFrame({
    "OrderID": [101, 102, 103, 104],
    "CustomerID": [1, 2, 2, 4],
    "Amount": [250, 400, 600, 150]
})

print(customers.head(2))
orders.head(2)

   CustomerID CustomerName
0           1        Alice
1           2          Bob

   OrderID  CustomerID  Amount
0      101           1     250
1      102           2     400

In [96]:
pd.merge(customers, orders, on='CustomerID')

   CustomerID CustomerName  OrderID  Amount
0           1        Alice      101     250
1           2          Bob      102     400
2           2          Bob      103     600
3           4        David      104     150

In [97]:
# NB: No test for this. Just an exercise for you to play around with
employees = pd.DataFrame({
    "EmpID": [101, 102, 103, 104],
    "EmpName": ["John", "Jane", "Alice", "Bob"],
    "DeptID": [1, 2, 2, 3]
})

departments = pd.DataFrame({
    "DeptID": [1, 2],
    "DeptName": ["HR", "Finance"]
})

print(employees.head(2))
departments.head(2)

   EmpID EmpName  DeptID
0    101    John       1
1    102    Jane       2

   DeptID DeptName
0       1       HR
1       2  Finance

In [98]:
pd.merge(employees, departments, on="DeptID", how="left")

   EmpID EmpName  DeptID DeptName
0    101    John       1       HR
1    102    Jane       2  Finance
2    103   Alice       2  Finance
3    104     Bob       3      NaN

In [99]:
sales_pivot_data = pd.DataFrame({
    "Region": ["North", "North", "South", "South", "West", "West"],
    "Product": ["A", "B", "A", "B", "A", "B"],
    "Sales": [200, 300, 150, 400, 250, 500]
})

sales_pivot_data.head(2)

  Region Product  Sales
0  North       A    200
1  North       B    300

In [100]:
pv_table = sales_pivot_data.pivot_table(index=['Region', 'Product'], values='Sales', aggfunc='sum')
pv_table.reset_index(inplace=True)

pv_table

  Region Product  Sales
0  North       A    200
1  North       B    300
2  South       A    150
3  South       B    400
4   West       A    250
5   West       B    500